# Built In Failures Reshape From Facets Failures Reshape From Facets Failed Error Property

Source: https://www.revitapidocs.com/2026/509dbdac-013f-f265-b939-fe9ba1cc3fd8.htm

---

| Built In Failures Reshape From Facets Failures Reshape From Facets Failed Error Property |
| --- |

Reshape from facets failed. \[Description]
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId ReshapeFromFacetsFailedError { get; }
```

```
Public Shared ReadOnly Property ReshapeFromFacetsFailedError As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ ReshapeFromFacetsFailedError {
	FailureDefinitionId^ get ();
}
```

```
static member ReshapeFromFacetsFailedError : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ReshapeFromFacetsFailures Class Autodesk.Revit.DB Namespace